src/DataProcessors/ЗагрузкаИсторииЭтаповЗадачМетеор/ЗагрузкаИсторииЭтаповЗадачМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИсторииЭтаповЗадачМетеор</name>
  <attributes>
    <name>НачалоПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонецПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

src/InformationRegisters/ЗначенияНастроекПрограммы/ЗначенияНастроекПрограммы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияНастроекПрограммы</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.НастройкиПрограммы</types>
    </type>
  </resources>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.НастройкиПрограммы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗначения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/ЗагрузкаИсторииЭтаповЗадачМетеор/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Настройка = ПланыВидовХарактеристик.НастройкиПрограммы.ОтметкаВремениЗагрузкиЭтаповМетеор;
	Объект.НачалоПериода = РегистрыСведений.ЗначенияНастроекПрограммы.ПолучитьЗначениеНастройки(Настройка);
	Объект.КонецПериода = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Регламент(Команда)
	РегламентНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере()
	ДанныхЗаписано = РаботаСДаннымиМетеор.ЗагрузкаИсторииЭтаповЗадачМетеорЗаПериод(Объект.НачалоПериода, Объект.КонецПериода);
	Сообщить(ДанныхЗаписано);
КонецПроцедуры

&НаСервере
Процедура РегламентНаСервере()
	РаботаСДаннымиМетеор.ЗагрузкаИсторииЭтаповЗадачМетеорОбработчикЗадания();
КонецПроцедуры

#КонецОбласти
